fio/results/fio-res_201904230400
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68723;67;10013;54;451;71.888406;18.447834;2717;24259;14822.139519;4213.944909;1.000000%=2801;5.000000%=3129;10.000000%=5013;20.000000%=15400;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16449;80.000000%=16449;90.000000%=16711;95.000000%=17956;99.000000%=20316;99.500000%=22151;99.900000%=24248;99.950000%=24248;99.990000%=24248;0%=0;0%=0;0%=0;2774;24337;14894.804475;4215.871544;47407;156444;78.560614%;53989.210526;24828.676249;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.609269%;0.000000%;673;0;289;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;7.89%;4.02%;87.05%;1.04%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36604;0;0;366023;361536;727709;98.02%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68723;67;10013;55;184;85.956935;17.470924;2865;153838;14808.273442;9062.604338;1.000000%=3096;5.000000%=3325;10.000000%=3620;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16580;99.000000%=17432;99.500000%=22413;99.900000%=154140;99.950000%=154140;99.990000%=154140;0%=0;0%=0;0%=0;2949;153913;14894.991259;9064.080173;45176;153826;75.131592%;51632.684211;24758.383314;0.000000%;0.689173%;672;0;28;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;14.14%;1.49%;83.63%;0.30%;0.00%;0.45%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36604;0;0;366023;361536;727709;98.02%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134740;13455;3363;10014;2;70;8.646220;2.448560;240;24498;9500.000401;2943.517005;1.000000%=473;5.000000%=708;10.000000%=6586;20.000000%=10027;30.000000%=10158;40.000000%=10289;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10682;95.000000%=11468;99.000000%=13172;99.500000%=13828;99.900000%=16449;99.950000%=18743;99.990000%=22937;0%=0;0%=0;0%=0;249;24508;9509.260240;2944.142636;8565;29402;71.904399%;9674.736842;4777.182885;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.667832%;5.003495%;31225;0;63;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;1.32%;4.34%;2.51%;1.06%;0.69%;10.82%;79.23%;0.04%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36604;0;0;366023;361536;727709;98.02%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;126264;12612;3153;10011;2;72;11.171488;4.240536;714;20214;10132.440626;1494.780520;1.000000%=2834;5.000000%=7766;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=10813;99.500000%=11993;99.900000%=16056;99.950000%=17694;99.990000%=19005;0%=0;0%=0;0%=0;730;20223;10144.312143;1495.338323;12224;19736;100.000000%;12614.000000;1676.386841;4.845155%;2.907093%;31064;0;29;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.02%;3.09%;2.59%;94.26%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36604;0;0;366023;361536;727709;98.02%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=26764: Tue Apr 23 04:00:43 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=54, max=451, avg=71.89, stdev=18.45
    clat (usec): min=2717, max=24259, avg=14822.14, stdev=4213.94
     lat (usec): min=2774, max=24337, avg=14894.80, stdev=4215.87
    clat percentiles (usec):
     |  1.00th=[ 2802],  5.00th=[ 3130], 10.00th=[ 5014], 20.00th=[15401],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16450], 80.00th=[16450], 90.00th=[16712], 95.00th=[17957],
     | 99.00th=[20317], 99.50th=[22152], 99.90th=[24249], 99.95th=[24249],
     | 99.99th=[24249]
   bw (  KiB/s): min=47407, max=156444, per=78.56%, avg=53989.21, stdev=24828.68, samples=19
   iops        : min=   46, max=  152, avg=52.16, stdev=24.19, samples=19
  lat (msec)   : 4=7.89%, 10=4.02%, 20=87.05%, 50=1.04%
  cpu          : usr=0.61%, sys=0.00%, ctx=673, majf=0, minf=289
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=26765: Tue Apr 23 04:00:43 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=55, max=184, avg=85.96, stdev=17.47
    clat (msec): min=2, max=153, avg=14.81, stdev= 9.06
     lat (msec): min=2, max=153, avg=14.89, stdev= 9.06
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[   17],
     | 30.00th=[   17], 40.00th=[   17], 50.00th=[   17], 60.00th=[   17],
     | 70.00th=[   17], 80.00th=[   17], 90.00th=[   17], 95.00th=[   17],
     | 99.00th=[   18], 99.50th=[   23], 99.90th=[  155], 99.95th=[  155],
     | 99.99th=[  155]
   bw (  KiB/s): min=45176, max=153826, per=75.13%, avg=51632.68, stdev=24758.38, samples=19
   iops        : min=   44, max=  150, avg=50.05, stdev=24.21, samples=19
  lat (msec)   : 4=14.14%, 10=1.49%, 20=83.63%, 50=0.30%, 250=0.45%
  cpu          : usr=0.00%, sys=0.69%, ctx=672, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=26766: Tue Apr 23 04:00:43 2019
   read: IOPS=3363, BW=13.1MiB/s (13.8MB/s)(132MiB/10014msec)
    slat (nsec): min=2545, max=70141, avg=8646.22, stdev=2448.56
    clat (usec): min=240, max=24498, avg=9500.00, stdev=2943.52
     lat (usec): min=249, max=24508, avg=9509.26, stdev=2944.14
    clat percentiles (usec):
     |  1.00th=[  474],  5.00th=[  709], 10.00th=[ 6587], 20.00th=[10028],
     | 30.00th=[10159], 40.00th=[10290], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10683], 95.00th=[11469],
     | 99.00th=[13173], 99.50th=[13829], 99.90th=[16450], 99.95th=[18744],
     | 99.99th=[22938]
   bw (  KiB/s): min= 8565, max=29402, per=71.90%, avg=9674.74, stdev=4777.18, samples=19
   iops        : min= 2141, max= 7350, avg=2418.26, stdev=1194.28, samples=19
  lat (usec)   : 250=0.01%, 500=1.32%, 750=4.34%, 1000=2.51%
  lat (msec)   : 2=1.06%, 4=0.69%, 10=10.82%, 20=79.23%, 50=0.04%
  cpu          : usr=1.67%, sys=5.00%, ctx=31225, majf=0, minf=63
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33685,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=26767: Tue Apr 23 04:00:43 2019
  write: IOPS=3153, BW=12.3MiB/s (12.9MB/s)(123MiB/10011msec)
    slat (nsec): min=2777, max=72441, avg=11171.49, stdev=4240.54
    clat (usec): min=714, max=20214, avg=10132.44, stdev=1494.78
     lat (usec): min=730, max=20223, avg=10144.31, stdev=1495.34
    clat percentiles (usec):
     |  1.00th=[ 2835],  5.00th=[ 7767], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[10814], 99.50th=[11994], 99.90th=[16057], 99.95th=[17695],
     | 99.99th=[19006]
   bw (  KiB/s): min=12224, max=19736, per=100.00%, avg=12614.00, stdev=1676.39, samples=20
   iops        : min= 3056, max= 4934, avg=3153.50, stdev=419.10, samples=20
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=3.09%, 10=2.59%, 20=94.26%, 50=0.01%
  cpu          : usr=4.85%, sys=2.91%, ctx=31064, majf=0, minf=29
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31566,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10014-10014msec

Run status group 3 (all jobs):
  WRITE: bw=12.3MiB/s (12.9MB/s), 12.3MiB/s-12.3MiB/s (12.9MB/s-12.9MB/s), io=123MiB (129MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39061/36604, merge=0/0, ticks=366023/361536, in_queue=727709, util=98.02%